Repository: luccidnz/hold_that_thought
Catalog: lib/l10n/app_*.arb
Languages: mi

# appTitle
source: Hold That Thought
mi: Puritia Te Whakaaro

# homeTitle
source: Notes
mi: Ngā Tuhipoka

# settingsTitle
source: Settings
mi: Tautuhinga

# themeLabel
source: Theme
mi: Kaupapa

# themeSystem
source: System
mi: Pūnaha

# themeLight
source: Light
mi: Mārama

# themeDark
source: Dark
mi: Pōuri

# accentLabel
source: Accent
mi: Tae Tohu

source: Quick Capture
mi: Hopukina Tere

# searchHint
source: Search notes…
mi: Rapu tuhipoka…

source: Pinned
mi: Kua Piri

source: All Notes
mi: Ngā Tuhipoka Katoa

source: Save
mi: Tiaki

source: Cancel
mi: Whakakore

source: Undo
mi: Wetekia

source: View
mi: Tirohia

source: Note Saved
mi: Kua Tiakina te Tuhipoka

# titleHint
source: Title
mi: Taitara

# bodyHint
source: Body
mi: Tinana

# pinButtonTooltip
source: Pin note
mi: Tīpina te tuhipoka

# viewAllNotesTooltip
source: View all notes
mi: Tirohia ngā tuhipoka katoa

# settingsTooltip
source: Settings
mi: Tautuhinga

# filterByTagTooltip
source: Filter by {tag}
mi: Tātarihia mā te {tag}

# settingsThemeModeLabel
source: Theme Mode
mi: Aratau Kaupapa

# settingsAccentLabel
source: Accent Color
mi: Tae Kōkaha

# settingsLanguageLabel
source: Language
mi: Reo

# settingsSyncLabel
source: Sync
mi: Tukutahi

# settingsThemeSystem
source: System
mi: Pūnaha

# settingsThemeLight
source: Light
mi: Mārama

# settingsThemeDark
source: Dark
mi: Pōuri

# settingsLanguageSystem
source: System
mi: Pūnaha

# settingsLanguageEnglish
source: English
mi: Ingarihi

# settingsSetAccent
source: Set accent color to {accentName}
mi: Tautuhia te tae kōkaha ki te {accentName}

# settingsAutoSync
source: Auto-sync (stub)
mi: Tukutahi-aunoa (tumau)

# noteDetailTitle
source: Note Detail
mi: Taipitopito Tuhipoka

# noteDetailId
source: Note ID: {id}
mi: ID Tuhipoka: {id}

# listPageTitle
source: Thoughts
mi: Ngā Whakaaro

# listPageBody
source: List Page
mi: Whārangi Rārangi

# listPageBodyFiltered
source: List Page (Filtered by tag: {tag})
mi: Whārangi Rārangi (Kua tātarihia e te tūtohu: {tag})

# notFoundTitle
source: Page Not Found
mi: Kāore i Kitea te Whārangi

# notFoundBody
source: 404 - Page Not Found
mi: 404 - Kāore i Kitea te Whārangi

# goHomeButton
source: Go Home
mi: Hoki ki te Kāinga
